INSERT INTO branches (name, address, phone) VALUES
('АльфаСтрахование', 'г. Новосибирск, ул. ​Октябрьская магистраль, 2', '+7-909-533-44-12'),
('Гранд Авто', 'г. Новосибирск, ул. Проезд Энергетиков, 4а', '+7-383-388-79-57'),
('Российское Страховое Агенство', 'г. Новосибирск, ул. Гусинобродское шоссе, 64', '+7-913-983-64-10'),
('ОСАГО54.РФ', 'г. Новосибирск, ул. Кошурникова, 11/1', '+7-923-241-75-42');

INSERT INTO clients (full_name, address, phone, gender, birth_date, passport_number) VALUES
('Болотников Евлампий Фролович', 'г. Новосибирск, ул. Спортивная Улица, 20', '+7-913-123-45-65', 'M', '1980-05-12', '1234 567890'),
('Листунов Руслан Олегович', 'г. Новосибирск, ул. Мичурина, 5', '+7-913-234-56-78', 'M', '1992-11-05', '2345 678901'),
('Мальцов Валерьян Алексеевич', 'г. Новосибирск, ул. Дзержинского, 9', '+7-913-345-67-09', 'M', '1985-02-28', '3456 789012'),
('Енотин Денис Федосиевич', 'г. Новосибирск, ул. Кирова, 20', '+7-913-456-78-90', 'M', '1990-06-14', '4567 890123'),
('Водоватов Емельян Иосифович', 'г. Новосибирск, ул. Бориса Богаткова, 25', '+7-913-567-89-01', 'M', '1988-07-22', '5678 901234'),
('Долгоруков Модест Александрович', 'г. Новосибирск, ул. Советская, 12', '+7-913-123-45-67', 'M', '1975-03-09', '6789 012345'),
('Аксёнов Назар Родионович', 'г. Новосибирск, ул. Мичурина, 3', '+7-913-234-44-78', 'M', '1997-09-13', '7890 123456'),
('Сапрыкин Парфен Титович', 'г. Новосибирск, ул. Дзержинского, 11', '+7-913-345-67-89', 'M', '1983-12-30', '8901 234567');

INSERT INTO agents (full_name, address, phone, salary, branch_id) VALUES
('Алистратов Вячеслав Герасимович', 'г. Новосибирск, ул. Челюскинцев, 18', '+7-913-678-90-12', 50000.00, 1),
('Щетинин Моисей Михеевич', 'г. Новосибирск, ул. Гоголя, 3', '+7-913-789-01-23', 45000.00, 2),
('Фаммус Эмма Кировна', 'г. Новосибирск, ул. Кирова, 13', '+7-913-890-12-34', 52000.00, 3),
('Катаева Ирина Евремовна', 'г. Новосибирск, ул. Пролетарская, 13', '+7-993-890-12-34', 60000.00, 4),
('Сазонова Варвара Николаевна', 'г. Новосибирск, ул. Высоцкого, 51', '+7-913-891-12-44', 47000.00, 4);

INSERT INTO insurance_types (type_name) VALUES
('Страхование квартиры'),
('Медицинское страхование'),
('Автострахование'),
('Страхование жизни');

INSERT INTO contracts (date, insurance_type_id, insurance_amount, rate, branch_id, client_id, agent_id, contract_status) VALUES
('2024-02-10', 1, 300000.00, 3.0, 1, 1, 1, 'active'),
('2024-03-20', 2, 100000.00, 1.8, 1, 2, 1, 'active'),
('2024-03-20', 2, 100000.00, 1.8, 1, 3, 1, 'terminated'),
('2024-01-15', 3, 200000.00, 2.5, 2, 4, 2, 'terminated'),
('2024-01-15', 3, 200000.00, 2.5, 2, 5, 2, 'expired'),
('2024-01-15', 3, 200000.00, 2.5, 2, 6, 2, 'active'),
('2024-03-05', 4, 500000.00, 4.0, 3, 4, 3, 'terminated'),
('2024-03-05', 4, 500000.00, 4.0, 3, 7, 3, 'expired'),
('2024-04-10', 3, 250000.00, 2.8, 4, 8, 4, 'active'),
('2024-04-10', 3, 250000.00, 2.8, 4, 1, 5, 'active');